Данное домашнее задание посвящено схеме базе данных, связанной с футбольным командами. Схема расположена в hw_diagram.jpg
## Описание таблиц 

### Positions 
Позиции игроков
id - уникальный идентификатор позиции 
Name - Название таблицы 

### Coaches 
Таблица тренеров 
id - уникальный идентификатор тренера
Name - имя тренера 

## Teams 
Таблица команд 
id - уникальный идентификатор  команды 
Name - имя команды 
Location - расположение команды 
Coach_id - идентификатор тренера 

### Players 
Таблица игроков 
Id - уникальный идентификатор игрока 
Name - имя игрока 
Age - возраст игрока 
Position_id - идентификатор позиции 
Team_id - идентификатор команды 
Start_date - дата начала игры в команде 

### PlayersArchive 
Архив по игрокам (информация о том, в какой команде игрок играл ранее) 
player_id - идентификатор игрока 
team_id - идентификатор команды 
start_date - дата начала игры 
end_date - дата окончания игры

# Задание 1
Реализовать перенакатываемые sql-скрипты по схеме hw_diagram, приложенного ниже.

In [1]:
%load_ext sql
%sql sqlite:///chinook.db

'Connected: @chinook.db'

In [2]:
%%sql
Pragma foreign_key=on;
DROP TABLE if exists Positions;
CREATE TABLE Positions (ID integer Primary key,
                        position_name varchar(20)
                       );

DROP TABLE if exists Coaches;
CREATE TABLE Coaches (ID integer Primary key,
                      coach_name varchar(20)
                     );

DROP TABLE if exists Teams;
CREATE TABLE Teams (ID integer Primary key,
                   team_name varchar(20),
                   location varchar(20),
                   coach_id integer,
                   foreign key(coach_id) references Coaches(ID)
                  );

DROP TABLE if exists Players;
CREATE TABLE Players (ID integer Primary key,
                      player_name varchar(20),
                      age integer,
                      start_date date,
                      position_id integer,
                      team_id integer,
                      foreign key(team_id) references Teams(ID),
                      foreign key(position_id) references Posirions(ID)
                     );

DROP TABLE if exists PlayersArchive;
CREATE TABLE PlayersArchive (player_id integer,
                             team_id integer,
                             start_date date,
                             end_date date,
                             Primary key(player_id, team_id, start_date),
                             foreign key(player_id) references Players(ID),
                             foreign key(team_id) references Teams(ID)
                            );

 * sqlite:///chinook.db
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.

[]

# Задание 2
Написать sql-скрипт, осуществляюший добавление всех возможных позиций игроков. (В данной задаче можно ограничится четырьмя - вратарь, защитник, полузащитник, нападающий)

In [3]:
import sqlite3
db=sqlite3.connect('chinook.db')
def insert_position(name):
    cur = db.cursor()
    cur.execute( '''select coalesce(max(ID)+1,1) from Positions''')
    ID = cur.fetchone()[0]
    cur.execute('''insert into Positions(ID, position_name) VALUES(?,?)''', (ID,name))
    db.commit()

In [4]:
insert_position('goalkeeper')
insert_position('defender')
insert_position('halfback')
insert_position('forward')

In [5]:
%%sql
select * from Positions

 * sqlite:///chinook.db
Done.

[(1, 'goalkeeper'), (2, 'defender'), (3, 'halfback'), (4, 'forward')]

# Задание 3
Написать функцию, осуществляющую добавление тренера. На вход функции подается имя тренера. При невозможности вставки функция должна обработать данное исключение и вывести пользователю информацию о проблеме

После написания функции необходимо добавить несколько тренеров для таблицы.

In [6]:
def insert_coach(name):
    cur = db.cursor()
    cur.execute('''select coalesce(max(ID)+1,1) from Coaches''')
    ID = cur.fetchone()[0]
    try:
        cur.execute('''insert into Coaches(ID, coach_name) VALUES(?,?)''', (ID,name))
        db.commit()
    except TypeError:
        print('произошла ошибка')

In [7]:
insert_coach('Johnson')
insert_coach('Nackson')
insert_coach('Kerly')
insert_coach('Tomphson')

In [8]:
%%sql
select * from Coaches

 * sqlite:///chinook.db
Done.

[(1, 'Johnson'), (2, 'Nackson'), (3, 'Kerly'), (4, 'Tomphson')]

# Задание 4

Написать функцию, осуществляющую добавление команды. На вход функция принимает (имя команды, местоположение, имя тренера).
На выходе должна быть добавлена команда.

После написания функции необходимо добавить несколько команд

In [9]:
def insert_team(name, location, name_coach):
    cur = db.cursor()
    coach_id = check_coach(name_coach)
    if coach_id==-1:
        return -1 
    cur.execute('''select coalesce(max(ID)+1,1) from Teams''')
    ID = cur.fetchone()[0]
    cur.execute('''insert into Teams(ID, team_name, location, coach_id) VALUES(?,?,?,?)''', (ID,name,location,coach_id))
    db.commit()

In [10]:
def check_coach(name):
    cur = db.cursor()
    cur.execute('''select ID from Coaches where coach_name = ?''', (name,))
    try:
        coach_id = cur.fetchone()[0]
        return coach_id
    except TypeError:
        print('Такого тренера не существует')
        return -1

In [11]:
insert_team('Barsa','Barselona','Johnson')
insert_team('Real','Madrid','Nackson')
insert_team('Chelsea','London','Kerly')

In [12]:
%%sql
select * from Teams

 * sqlite:///chinook.db
Done.

[(1, 'Barsa', 'Barselona', 1),
 (2, 'Real', 'Madrid', 2),
 (3, 'Chelsea', 'London', 3)]

# Задание 5

Написать функцию, осуществляющую обновление информации о команде. У функции на входе должен быть один обязательный параметр - название команды и два необязательных параметра - имя тренера и местоположение. При этом хотя бы один из необязательных параметров должен быть заполнен. Функция должна обновлять значение переданных необязательных параметров.

После написания функции вызовите данную функцию несколько раз

In [13]:
def update_team(name_team,name_coach=None, location=None):
    if name_coach==None and location==None:
        print('Не введен не один из необязательных параметров')
        return -1
    cur = db.cursor()
    if location is None:
        cur.execute('''update teams set coach_id = (select ID from coaches where coach_name = ?) where team_name = ?''',
                    (name_coach,name_team))
        db.commit()
    elif name_coach is None:
        cur.execute('''update teams set location = ? where team_name = ?''',(location,name_team))       
        db.commit()
    else:
        cur.execute('''update teams set location = ?, coach_id = (select ID from coaches where coach_name = ?) 
                  where team_name = ?''',(location,name_coach,name_team))   
        db.commit()

In [14]:
update_team('Real',location='Sevilya')
update_team('Real',name_coach='Tomphson')

In [15]:
%%sql
select * from teams

 * sqlite:///chinook.db
Done.

[(1, 'Barsa', 'Barselona', 1),
 (2, 'Real', 'Sevilya', 4),
 (3, 'Chelsea', 'London', 3)]

# Задание 6

Написать функцию, осуществляющую добавление нового футболиста в таблицу игроков. На входе (имя, возраст, название позиции, название команды, дата перехода в команду(необязательный параметр)). Если дата перехода не указана, то нужно использовать текущую дату. Предусмотреть различные ошибки (такие как неверное имя позиции, неверное название команды, возраст < 10 и > 50 и т.п.)

После написания функции необходимо добавить несколько игроков.

In [16]:
import datetime
def insert_player(name_player, age_player, position_player,team,start_date_player=None):
    
    result=check_data(start_date_player)
    if result == 0:
        print('Неподходящий формат даты!')
        return -1
        
    position_id = check_position(position_player)
    if position_id==-1:
        return -1 
    
    team_id = check_team(team)
    if team_id==-1:
        return -1 
    
    if age_player<10 or age_player>50:
        print('Неподходящий возраст')
        return -1
    
    if start_date_player==None:
        start_date_player=date.today()
    
    cur = db.cursor()        
    cur.execute('''select coalesce(max(ID)+1,1) from Players''')
    ID = cur.fetchone()[0]
    cur.execute('''insert into Players(ID, player_name, age, start_date,position_id,team_id) VALUES(?,?,?,?,?,?)''',
                (ID,name_player,age_player,start_date_player,position_id,team_id))
    db.commit()

In [17]:
def check_position(position_player):
    cur = db.cursor()
    cur.execute('''select ID from Positions where position_name = ?''', (position_player,))
    try:
        position_id = cur.fetchone()[0]
        return position_id
    except TypeError:
        print('Такой позиции не существует')
        return -1

In [18]:
def check_team(team):
    cur = db.cursor()
    cur.execute('''select ID from teams where team_name = ?''', (team,))
    try:
        team_id = cur.fetchone()[0]
        return team_id
    except TypeError:
        print('Такой команды не существует')
        return -1

In [19]:
def check_data(date):
    try:
        datetime.datetime.strptime(date,"%Y-%m-%d")
        return 1
    except ValueError:
        print('date fail')
        return 0

In [20]:
insert_player('Messi', 31, 'forward','Barsa','2003-02-02')
insert_player('Drogba', 41, 'forward','Chelsea','2012-05-15')
insert_player('Benzema', 31, 'forward','Real','2010-11-23')
insert_player('Oshibka', 28, 'forward','Real','NeverniFotmatDati')

date fail
Неподходящий формат даты!

-1

In [21]:
%%sql
select * from Players

 * sqlite:///chinook.db
Done.

[(1, 'Messi', 31, '2003-02-02', 4, 1),
 (2, 'Drogba', 41, '2012-05-15', 4, 3),
 (3, 'Benzema', 31, '2010-11-23', 4, 2)]

# Задание 7
Написать функцию для перевода игрока в другую команду. Данная функция должна осуществить архивирование текущей записи в таблице игроков в таблицу players_archive с заполнение end_date - датой начала игры за новую команду - 1 день. А также осуществлять изменение поля в таблице Players. При возникновении ошибки должен осуществляться полный откат транзакции.

In [22]:
import datetime
def transaction_team_player(player,old_team,new_team,start_date_new_team):
    
    old_team_id = check_team(old_team)
    if old_team_id==-1:
        return -1 
    
    new_team_id = check_team(new_team)
    if new_team_id==-1:
        return -1 

    player_id = check_player(player,old_team_id)
    if player_id==-1:
        return -1 
    
    cur = db.cursor()
    cur.execute('''select start_date from Players where ID = ?''', (player_id,))
    start_date_old_team=cur.fetchone()[0]
    
   
   #cur.execute('''select DATE(?, '-1 day')''', (start_date_new_team,))
   #end_date_old_team=cur.fetchone()[0]
    end_date_old_team=datetime.datetime.strptime(start_date_new_team,"%Y-%m-%d")
    end_date_old_team=(end_date_old_team - datetime.timedelta(days=1)).strftime("%Y-%m-%d")
    
    try:
        cur.execute('''insert into PlayersArchive(player_id, team_id, start_date, end_date) VALUES(?,?,?,?)''',
                (player_id,old_team_id,start_date_old_team,end_date_old_team))
        cur.execute('''Update Players set start_date = ?,team_id = ? where ID = ?''',
                (start_date_new_team,new_team_id,player_id))
        db.commit()
    except db.Error:
        print('failed!')
        db.rollback()

In [23]:
def check_player(player,team_id):
    cur = db.cursor()
    cur.execute('''select ID from Players where player_name = ? and team_id = ?''', (player,team_id))
    try:
        player_id = cur.fetchone()[0]
        return player_id
    except TypeError:
        print('Такого игрока не существует')
        return -1

In [24]:
def check_team(old_team):
    cur = db.cursor()
    cur.execute('''select ID from Teams where team_name = ?''', (old_team,))
    try:
        team_id = cur.fetchone()[0]
        return team_id
    except TypeError:
        print('Такой команды не существует')
        return -1

In [25]:
transaction_team_player('Messi','Barsa','Real','2019-02-19')
transaction_team_player('Messi','Real','Chelsea','2019-03-07')
transaction_team_player('Messi','Chelsea','Barsa','2019-04-07')
transaction_team_player('Messi','Barsa','Real','2019-05-19')
transaction_team_player('Messi','Real','Chelsea','2019-06-07')
transaction_team_player('Messi','Chelsea','Barsa','2019-07-07')

In [26]:
%%sql
select * from PlayersArchive

 * sqlite:///chinook.db
Done.

[(1, 1, '2003-02-02', '2019-02-18'),
 (1, 2, '2019-02-19', '2019-03-06'),
 (1, 3, '2019-03-07', '2019-04-06'),
 (1, 1, '2019-04-07', '2019-05-18'),
 (1, 2, '2019-05-19', '2019-06-06'),
 (1, 3, '2019-06-07', '2019-07-06')]

In [27]:
%%sql
select * from Players

 * sqlite:///chinook.db
Done.

[(1, 'Messi', 31, '2019-07-07', 4, 1),
 (2, 'Drogba', 41, '2012-05-15', 4, 3),
 (3, 'Benzema', 31, '2010-11-23', 4, 2)]